# Belajar pandas

## #01: Menyertakan prefix dan suffix pada kolom data frame

In [53]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.3
1.21.2

In [54]:
# Persiapan data frame
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10, size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  1  2  9  1  8
1  1  1  8  2  6
2  8  4  8  2  1
3  2  8  1  3  1
4  7  7  3  1  7

In [55]:
tuple('ABCDE')

('A', 'B', 'C', 'D', 'E')

In [56]:
# Menyertakan prefix kolom
df.add_prefix('kolom_')

   kolom_A  kolom_B  kolom_C  kolom_D  kolom_E
0        1        2        9        1        8
1        1        1        8        2        6
2        8        4        8        2        1
3        2        8        1        3        1
4        7        7        3        1        7

In [57]:
#Menyertakan sufix kolom
df.add_suffix('_field')

   A_field  B_field  C_field  D_field  E_field
0        1        2        9        1        8
1        1        1        8        2        6
2        8        4        8        2        1
3        2        8        1        3        1
4        7        7        3        1        7

## #02: Pemilihan baris (rows selection) pada data frame

In [58]:
# Persiapan data frame
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,5, size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  2  1  4  2  1
1  2  1  4  4  4
2  1  3  1  4  2
3  2  2  4  4  2
4  1  1  1  4  3
5  3  4  4  4  1
6  4  3  2  1  2
7  2  1  1  1  3
8  1  4  4  1  3
9  4  4  1  1  4

In [59]:
# Selection dengan operator logika | (or)
df[(df['A'] == 1) | (df['A'] == 3)]

   A  B  C  D  E
2  1  3  1  4  2
4  1  1  1  4  3
5  3  4  4  4  1
8  1  4  4  1  3

In [60]:
# Selection dengan fungsi isin()
df[df['A'].isin([1,3])]

   A  B  C  D  E
2  1  3  1  4  2
4  1  1  1  4  3
5  3  4  4  4  1
8  1  4  4  1  3

In [61]:
# Mengenal operator negasi ~
df[~df['A'].isin([1,3])]

   A  B  C  D  E
0  2  1  4  2  1
1  2  1  4  4  4
3  2  2  4  4  2
6  4  3  2  1  2
7  2  1  1  1  3
9  4  4  1  1  4

## #03: Konversi tipe data string ke numerik pada kolom data frame

In [62]:
# Persiapan data frame
data = {'col1':['1','2','3','teks'],
        'col2':['1','2','3','4']}

df=pd.DataFrame(data)
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [63]:
df.dtypes

col1    object
col2    object
dtype: object

In [64]:
# konversi tipe data dengan fungsi astype()
df_x = df.astype({'col2':'int64'})
df_x

   col1  col2
0     1     1
1     2     2
2     3     3
3  teks     4

In [65]:
df_x.dtypes

col1    object
col2     int64
dtype: object

In [66]:
# Konversi tipe data numerik dengan fungsi to_numeric()
df.apply(pd.to_numeric, errors ='coerce')

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4

## #04: Pemiliihan kolom (columns selection) pada pandas data frame berdasarkan tipe data